# FSObject

## Description
Function FSObject returns the handle to the first selected object in the referenced layer. If no objects are selected, the function returns NIL.

```pascal
FUNCTION FSObject(h : HANDLE): HANDLE;
```

```python
def vs.FSObject(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling